CISCO_설정(1)
===

Router Interface 설정
---

```
Router(config)# interface [Interface 이름] [Interface port번호]
Router(config-if)# ip address [IP주소] [서브넷마스크]
Router(config-if)# no shutdown
Router(config-if)# exit
```

##### Fast Ethernet Port 설정 방법
```
Router(config)# int fa0/0
Router(config-if)# ip addr 200.100.100.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
```

##### Serial Port 설정 방법
```
Router(config)# int fa0/0
Router(config-if)# ip addr 200.200.200.1 255.255.255.252
Router(config-if)# no shutdown
Router(config-if)# clock rate 56000         --->  Back to Back 연결 DCE로 작동 시 Clock rate 설정
Router(config-if)# exit
```

Router 기타 설정
---

##### Console, Aux, Terminal 타임 아웃 설정
```
Router(config-line)# exec-timeout [분] [초]
Router(config-line)# exec-timeout 10 30     --->  10분 30초동안 작업 없으면 접속 끊음
Router(config-line)# exec-timeout 0 0       --->  접속 계속 유지
```

##### Interface 정보 입력
```
Router(config-if)# description [내용]
```

##### history size 조정
```
Router# terminal history size [num]
```
* history default는 10, 최대 255개까지 사용 가능
* history 삭제 시 **size 0**으로 설정

##### Router DNS 서버 찾기 해제
```
Router(config)# no ip domain-lookup
```

##### Router에 DNS 서버 설정
```
Router(config)# ip name-server 168.126.63.1
Router(config)# ip name-server 8.8.8.8
```

* **# show hosts**로 확인

##### config 내용 확인 시 Line 번호 표시
```
Router# sh run linenum
```

##### config 내용 중 특정 부분만 확인
```
Router# sh run | ?
- begin
- exclude
- include
- section
```
* Interface의 경우 \# show run int e0/0 명령어로 하위 configuration까지 출력 ---> 따라서 Interface를 section으로 확인할 필요 없음

* ex) Null 이란 이름이 포함된 정보만 확인
  ```
  Router# sh run | in Null
  ```


##### 화면에서 more 없이 보기
* config backup 할 때 유용. 해당 session만 유효, 다음 접속시 원래대로 돌아옴
```
Router# terminal length 0
또는
Router# terminal no length
```
* 범위 : 0 ~ 512


Router 정보 확인
---

##### show version (# sh ver)
  * H/W configuration, IOS version, IOS Filename 등 Router에 대한 기본 정보 제공
##### show interface (# sh int)
  * Router에 장착된 Interface 및 Interface 상태에 대한 정보 제공
  * 특정 Interface에 대한 정보 확인
    ```
    # show interface [Interface 이름] [Interface port번호]
    ```
##### show flash
* flash memory 정보 ---> 보조기억장치

##### show running-config (# sh run)
* RAM에 있는 현재 configuration file을 나타냄

##### show startup-config (# sh start)
* NVRAM에 있는 configuration file을 나타냄

##### show process
* 활동 중인 프로세스 정보
* \# show process cpu (CPU사용률까지 표시)

##### show memory
* Router의 모든 memory와 사용통계

##### show protocols
* L3 routed Protocol의 현재 상태

##### show clock
* Router 시간

##### show hosts
* ip domain name, name server, host table 등

##### show users
* terminal line에 대한 정보

##### show ip interface brief
* IP Interface의 상태와 설정 정보 등

##### show ip route
* IP Routing Table
* Windows는 **>netstat -r**


Router Configuration File과 IOS File Backup
---

##### 외부 TFTP Server에 configuration file과 IOS file을 저장하는 이유
* backup과 IOS image version upgrade 또는 downgrade
* 여러 대의 동일한 configuration을 수행할 경우

##### Configuration file의 copy 명령어
* RAM -> NVRAM
  ```
  Router# copy running-config startup-config
  ```
* RAM -> TFTP
  ```
  Router# copy running-config tftp
  ```
* NVRAM -> RAM
  ```
  Router# copy startup-config running-config
  ```
* NVRAM -> TFTP
  ```
  Router# copy startup-config tftp
  ```
* TFTP -> NVRAM
  ```
  Router# copy tftp startup-config
  ```

##### IOS file backup
* IOS upload
  ```
  Router# copy flash tftp
  ```
- IOS download
  ```
  Router# copy tftp flash
  ```
