CISCO 초기 설정
===

Router 기본 설정
---

* **Router 이름 설정**
```
Router(config)# hostname [Router_name]
```

* **Router 시간 설정**
```
Router# clock set *hh:mm:ss day month year*
(month표기 ---> jan, feb ...)
```

* **Router Banner 설정**
```
Router(config)# banner motd #[banner_내용]#
```
  * motd 
  * login 
  * incoming 
  * exec 

* **Router 설정 저장**
```
Router# copy running-conifg startup-config
= Router# write  (wr)
```
  * 설정한 내용은 임시기억장치 RAM에 저장. RAM은 전원 OFF 시 데이터가 지워지므로 데이터를 NVRAM에 저장하는 명령어

* **Router 설정 확인**
  > privilege mode에서 실행가능한 명령어 (ping, clock set 등)를 configure mode에서 명령어 앞에 **do**를 붙이면 명령어 실행 가능
```
Router# show running-config (sh run)
Router(config)# do show running-config (do sh run)
```

Router banner
---

* **exec** : login 후 userexec mode로 전환되기 전에 표시되는 banner
* **login** : login 전 보여주는 banner
* **motd** : 접속하면 모두에게 보여지는 banner
* **incoming** : 가상터미널 접속 시 보여지는 banner

##### motd -> login -> exec

: banner 내용을 # 대신 다른 특수문자를 사용할 수 있음 *(대신, banner의 시작과 끝이 같은 특수문자. @. $ 등)*
```
Router(config)# banner motd $### Authorized user only! ###$
```
