CISCO 초기 설정
===

Router 기본 설정
---

* **Router 이름 설정**
```
Router(config)# hostname [Router_name]
```

* **Router 시간 설정**
```
Router# clock set *hh:mm:ss day month year*
(month표기 ---> jan, feb ...)
```

* **Router Banner 설정**
```
Router(config)# banner motd #[banner_내용]#
```
  * motd 
  * login 
  * incoming 
  * exec 

* **Router 설정 저장**
```
Router# copy running-conifg startup-config
= Router# write  (wr)
```
  * 설정한 내용은 임시기억장치 RAM에 저장. RAM은 전원 OFF 시 데이터가 지워지므로 데이터를 NVRAM에 저장하는 명령어

* **Router 설정 확인**
  > privilege mode에서 실행가능한 명령어 (ping, clock set 등)를 configure mode에서 명령어 앞에 **do**를 붙이면 명령어 실행 가능
```
Router# show running-config (sh run)
Router(config)# do show running-config (do sh run)
```

Router banner
---

* **exec** : login 후 userexec mode로 전환되기 전에 표시되는 banner
* **login** : login 전 보여주는 banner
* **motd** : 접속하면 모두에게 보여지는 banner
* **incoming** : 가상터미널 접속 시 보여지는 banner

##### motd -> login -> exec

: banner 내용을 # 대신 다른 특수문자를 사용할 수 있음 *(대신, banner의 시작과 끝이 같은 특수문자. @. $ 등)*
```
Router(config)# banner motd $### Authorized user only! ###$
```

Privilege mode, Configuration mode 명령어
---

1. Privilege mode (#)
   * 하드웨어 구성 관련 명령
   * 테스트 명령
   * 정보 확인 명령
   * 재부팅

2. Configuration mode
   * 위 구성 명령을 제외한 모든 환경설정 
   * Sub configuration mode는 하나가 아닌 여러 process가 있는 환경설정을 하는 경우
     * ex) Interface의 경우 1개가 아닌 여러 개의 Interface를 가짐. 따라서 각각의 Interface가 독립적이기 때문에 Sub configuration mode가 존재
     * ex) banner 설정의 경우 장비에 사용되는 모든 사용자에게 보여지는 것이기 때문에 하나의 설정만 존재 ---> Sub configuration mode 없음


Router password 설정
---

#### User mode --> Privileged mode 변경 시 암호 설정
```
Router(config)# enable password [password입력]  (암호 평문 저장)
Router(config)# enable secret [password입력]    (암호 암호화 저장)
```
* **#show run**으로 확인
* 평문보단 암호화로 저장된 password를 우선
* 평문 암호를 암호화하는 명령어
  ```
  Router(config)# service password-encryption  (CISCO type7로 변경)
  ```

#### Console 접속 시 암호 설정
```
Router(config)# line console 0 (line con 0)
Router(config-line)# password [password입력]
Router(config-line)# login
```
* line : 환경설정을 위한 interface 이름

#### Aux 접속 시 암호 설정
```
Router(config)# line aux 0
Router(config-line)# password [password입력]
Router(config-line)# login
```

#### Terminal 접속 시 암호 설정
```
Router(config)# line vty 0 4 (5개 터미널 session 설정)   --->  interface ID가 0~4
Router(config-line)# password [password입력]
Router(config-line)# login
```

* 각각의 Terminal 별로 password를 설정하려면
```
Router(config)# line vty 0  (0번 session 암호 설정)
Router(config-line)# password (password입력)
Router(config-line)# login
Router(config)# line vty 1  (1번 session 암호 설정)
Router(config-line)# password [password입력]
Router(config-line)# login
```
  * 실제 업무에선 이러한 설정을 잘 하진 않음


Router Privilege Level (권한 설정)
---

* 관리자별로 ID를 주기 위해선 **username [ID] password [password]**
  ```
  Router(config)# username [ID] password [password입력]     <--- 로컬 계정 생성
  Router(config-line)# local login      <--- 로컬 계정 로그인
  ```
  
  ![](images/2023-06-11-17-34-25.png)

