CISCO_설정(1)
===

Router Interface 설정
---

```
Router(config)# interface [Interface 이름] [Interface port번호]
Router(config-if)# ip address [IP주소] [서브넷마스크]
Router(config-if)# no shutdown
Router(config-if)# exit
```

##### Fast Ethernet Port 설정 방법
```
Router(config)# int fa0/0
Router(config-if)# ip addr 200.100.100.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
```

##### Serial Port 설정 방법
```
Router(config)# int fa0/0
Router(config-if)# ip addr 200.200.200.1 255.255.255.252
Router(config-if)# no shutdown
Router(config-if)# clock rate 56000         --->  Back to Back 연결 DCE로 작동 시 Clock rate 설정
Router(config-if)# exit
```

Router 기타 설정
---

##### Console, Aux, Terminal 타임 아웃 설정
```
Router(config-line)# exec-timeout [분] [초]
Router(config-line)# exec-timeout 10 30     --->  10분 30초동안 작업 없으면 접속 끊음
Router(config-line)# exec-timeout 0 0       --->  접속 계속 유지
```

##### Interface 정보 입력
```
Router(config-if)# description [내용]
```

##### history size 조정
```
Router# terminal history size [num]
```
* history default는 10, 최대 255개까지 사용 가능
* history 삭제 시 **size 0**으로 설정

##### Router DNS 서버 찾기 해제
```
Router(config)# no ip domain-lookup
```

##### Router에 DNS 서버 설정
```
Router(config)# ip name-server 168.126.63.1
Router(config)# ip name-server 8.8.8.8
```

* **# show hosts**로 확인


Router 정보 확인
---

* show version (# sh ver)
  * H/W configuration, IOS version, IOS Filename 등 Router에 대한 기본 정보 제공
* show interface (# sh int)
  * Router에 장착된 Interface 및 Interface 상태에 대한 정보 제공
    ```
    # show interface [Interface 이름] [Interface port번호]